БИТУправление_медицинским_центром_демо/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.НастройкиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.НастройкиПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/CommonModules/УправлениеПользователями/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает значение по умолчанию и значения
//  реквизитов данного значения для передаваемого пользователя, настройки и списка реквизитов.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - текущий пользователь программы
//  Настройка	 - ПланыВидовХарактеристикСсыока.НастройкиПользователей	 - признак, для которого возвращается значение по умолчанию
// 
// Возвращаемое значение:
//  Произвольный - Элемент выборки запроса либо структура (в случае пустой выборки).
//
Функция ПолучитьЗначениеПоУмолчанию(Пользователь = Неопределено, Настройка) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Попытка
		НЗНастройки = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
		НЗНастройки.Отбор.Пользователь.Установить(Пользователь);
		НЗНастройки.Отбор.Настройка.Установить(ПланыВидовХарактеристик.НастройкиПользователей[Настройка]);
		НЗНастройки.Прочитать();
		
		Если НЗНастройки.Количество()<>0 Тогда
			
			Возврат НЗНастройки[0].Значение;
			
		Иначе
			
			Возврат ПланыВидовХарактеристик.НастройкиПользователей[Настройка].ТипЗначения.ПривестиЗначение(Неопределено);
			
		КонецЕсли;
		
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Установить значение настройки пользователя.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - текущий пользователь программы
//  Настройка	 - ПланыВидовХарактеристикСсыока.НастройкиПользователей	 - признак, для которого возвращается значение по умолчанию
//  Значение	 - Произвольный	 - значение настройки.
// 
// Возвращаемое значение:
//  Булево.
//
Функция УстановитьЗначение(Пользователь = Неопределено, Настройка, Значение) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ОбщегоНазначения.ТекущийПользователь();
	КонецЕсли;
	
	Попытка
		
		мзНастройкиПользователей = РегистрыСведений.НастройкиПользователей.СоздатьМенеджерЗаписи();
		мзНастройкиПользователей.Пользователь = Пользователь;
		мзНастройкиПользователей.Настройка = ПланыВидовХарактеристик.НастройкиПользователей[Настройка];
		мзНастройкиПользователей.Значение = Значение;
		мзНастройкиПользователей.Записать();
		
		Возврат Истина;
		
	Исключение 	
		Возврат Ложь;	
	КонецПопытки;
	
КонецФункции

#КонецОбласти
